# სიაში შესაძლებელია ნივთების შენახვა რიგ-რიგობით. ეს ნივთები შეიძლება იყოს რიცხვები, სიტყვები, ან სხვა ტიპის მონაცემები.
# ინდექსი არის სიის ელემენტის რიგითი ნომერი. Python-ში ინდექსი იწყება 0-დან, ანუ სიის პირველი ელემენტის ინდექსი არის 0, მეორის – 1 და ასე შემდეგ.
# indexing არის კონკრეტული ელემენტის სიის შიგნით არჩევის მეთოდი მისი ინდექსის გამოყენებით.
# თუ ობიექტი შესაძლებელია შეიცვალოს, მას mutable ეწოდება. მაგალითად, სია (list) არის ცვლილებადი, რადგან მასში შეგიძლიათ დაამატოთ ან წაშალოთ ელემენტები.
# თუ ობიექტს არ შეუძლია შეიცვალოს, მას immutable ეწოდება. 