// 1.
// npm არის პროგრამა, რომელიც გვაძლევს ბიბლიოთეკების დაყენების საშუალებას.
// Vite არის ხელსაწყო, რომელიც სწრაფად ქმნის და უშვებს React პროექტს.


// 2.
// node_modules – ფოლდერია, სადაც ინახება ყველა ბიბლიოთეკა, რაც npm-ით დავაყენეთ.
// src – მთავარი ფოლდერი, სადაც ჩვენი კოდი იწერება (კომპონენტები, სტილები და ა.შ.).
// App.jsx – ფაილია, სადაც ჩვენი ძირითადი React კომპონენტი იწერება.
// main.jsx – ფაილი, რომელიც აერთებს App.jsx-ს index.html-თან და პროექტს ამუშავებს.
// gitignore – ფაილი, სადაც ვწერთ იმას, რაც Git-ში არ უნდა აიტვირთოს (მაგალითად node_modules).
// package.json – ფაილი, სადაც პროექტის ინფორმაცია და გამოყენებული ბიბლიოთეკებია ჩაწერილი.
// package-lock.json – ფაილი, რომელიც ზუსტად ინახავს რომელი ვერსიები დაყენდა ბიბლიოთეკებიდან.
// vite.config.js – ფაილი, სადაც Vite-ის პარამეტრები ინახება (პროექტის კონფიგურაცია).
// index.html – მთავარი HTML ფაილია, სადაც React პროგრამა თავსდება. 